src/cf/DataProcessors/bon_РегистрацияБонусногоСчетаКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>bon_РегистрацияБонусногоСчетаКлиента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлятьОПроведенииАкции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Емаил</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменальныйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.bon_НоминальныеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БонусныйСчетПроверен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСверены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АнкетаРаспечатана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПривязалиКконтрагенту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткудаВыОНасУзнали</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦС_Опрос</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТелефоныПоНоменальному</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/bon_ТелефоныНомОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>bon_ТелефоныНомОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотовый</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>bon_НоминальныеОбъекты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.bon_НоминальныеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагенты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/bon_ВводВОборотНоминальныхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>bon_ВводВОборотНоминальныхОбъектов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.bon_СостоянияНоминальныхОбъектов</xr:Item>
				<xr:Item>InformationRegister.bon_СведенияОНоминальныхОбъектах</xr:Item>
				<xr:Item>AccumulationRegister.bon_ПартииБонусовНаСчетах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоминальныхОбъектов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.bon_ВидыНоминальныхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействияКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НоминальныеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номинал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоминальныйОбъект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.bon_НоминальныеОбъекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.bon_ХарактеристикиБонусов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Держатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/DataProcessors/bon_РегистрацияБонусногоСчетаКлиента/Forms/ФормаСоздания/Ext/Form/Module.bsl
&НаСервере
Функция СоздатьНаСервере()
	
	НомерСчета = СокрЛП(Объект.НомерКарты);
	ВидНО = Справочники.bon_ВидыНоминальныхОбъектов.БонусныеСчета;
	
	///Проверка чтобы были только "Цифры"
	Цифры = "0123456789";
	СтрКоличество = СтрДлина(НомерСчета);
	Для Счетчик = 1 По СтрКоличество Цикл
		Если Найти(Цифры,Сред(НомерСчета,Счетчик,1)) = 0 Тогда
			Сообщить("Некорректный номер!");
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	///Проверка на первую цыфору чтобы бала "7"
	Если Число(Сред(НомерСчета,1,1)) <> 7 Тогда
		Сообщить("Некорректный номер!");
		Возврат Ложь;	
	КонецЕсли;
	
	Если СтрДлина(НомерСчета) <> 10 Тогда
		Сообщить("Некорректный номер!");
		Возврат Ложь;
	КонецЕсли;
	
	Если ВРег(НомерСчета) <> НомерСчета Тогда
		Сообщить("Некорректный номер!");
		Возврат Ложь;
	КонецЕсли;
	
	////////////////////////////Проверяем есть ли бонусный на номере
	Запрос = Новый Запрос;
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	bon_ТелефоныНомОбъектов.bon_НоминальныеОбъекты КАК bon_НоминальныеОбъекты
	 |ИЗ
	 |	РегистрСведений.bon_ТелефоныНомОбъектов КАК bon_ТелефоныНомОбъектов
	 |ГДЕ
	 |	bon_ТелефоныНомОбъектов.Сотовый = &Сотовый
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	bon_ТелефоныНомОбъектов.bon_НоминальныеОбъекты";
	Запрос.УстановитьПараметр("Сотовый", НомерСчета);
	Рез = Запрос.Выполнить().Выгрузить();
	
	Если Рез.Количество() > 0 Тогда
		Сообщить("Счет с данным номером уже существует!");
		Возврат Ложь;	
	КонецЕсли;
	
	докВводВОборот = Документы.bon_ВводВОборотНоминальныхОбъектов.СоздатьДокумент();
	докВводВОборот.Дата = НачалоДня(ТекущаяДата()); 
	докВводВОборот.УстановитьНовыйНомер();
	
	докВводВОборот.ВидНоминальныхОбъектов = ВидНО;
	докВводВОборот.Комментарий = "Создание бонусного счета в магазине";
	//докВводВОборот.Подразделение = ЭтотОбъект.мчт_Подразделение; 
	
	//Если докВводВОборот.Подразделение.Пустая() Тогда 
	//	докВводВОборот.Подразделение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеПодразделениеОрганизации"); //Лисевцев 15/05/2018	
	//КонецЕсли;
	
	стрТЧ = докВводВОборот.НоминальныеОбъекты.Добавить();
	стрТЧ.Номер = НомерСчета;
	
	Попытка
		докВводВОборот.Записать(РежимЗаписиДокумента.Проведение);		
	Исключение
		Сообщить("Не удалось создать ввод в оборот !
		| Сообщите Администратору ! Попробуйте еще раз !");
		Возврат Ложь;
	КонецПопытки;
	//НО = Справочники.ма_НоминальныеОбъекты.НайтиПоКоду(НомерСчета);						
	//ОбработкаВводаНоминальногоОбъекта(НО, ВидНО);
	РежимТолькоНакопления = Истина;
	ВладелецНакопительнойКарты = Справочники.Контрагенты.ПустаяСсылка();
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура Создать(Команда)
	Если СоздатьНаСервере() Тогда
		Закрыть();	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаВводаНоминальногоОбъекта(НоминальныйОбъект, ВидНоминальногоОбъекта, РезультатОбработки = "", ВидБон = Неопределено)
	
	bon_БонуснаяПрограммаСервер.ОбработкаВводаНоминальногоОбъекта(ЭтотОбъект, НоминальныйОбъект, ВидНоминальногоОбъекта, РезультатОбработки);
		
	//ОбновлениеОтображения();
	
КонецПроцедуры // ОбработкаВводаНоминальногоОбъекта()
